In [1]:
import pyttsx3

In [2]:
myspeaker = pyttsx3.init()

In [3]:
myspeaker.say("welcome to linux world")

In [4]:
myspeaker.runAndWait()

In [5]:
db = [1,"vimal", "ok",98291]

In [6]:
db.insert(2,"v@gmail.com")

In [7]:
db

[1, 'vimal', 'v@gmail.com', 'ok', 98291]

In [8]:
db[3]

'ok'

In [9]:
db={
    "id":1,
    "name":"vimal",
    "remarks":"ok",
    "mob":98291
}

In [10]:
db

{'id': 1, 'name': 'vimal', 'remarks': 'ok', 'mob': 98291}

In [11]:
type(db)

dict

In [14]:
db["mob"]

98291

In [13]:
"name":"pop"

SyntaxError: illegal target for annotation (3315207895.py, line 1)

In [15]:
db={
    "id":1,
    "name":"vimal",
    "remarks":"ok",
    "mob":98291,
    "name":"pop"
}

In [16]:
db

{'id': 1, 'name': 'pop', 'remarks': 'ok', 'mob': 98291}

In [18]:
students = {
    "name":['vimal','abhi','rahul'],
    "remarks":['ok','good','vgood'],
    "mob":[1111,2222,3333]
}

In [19]:
students["mob"]

[1111, 2222, 3333]

In [20]:
import pandas     #rowwise operation

In [25]:
 pandas.DataFrame(students)

    name remarks   mob
0  vimal      ok  1111
1   abhi    good  2222
2  rahul   vgood  3333

In [26]:
mydb=  pandas.DataFrame(students)

In [27]:
type(mydb)

pandas.core.frame.DataFrame

In [33]:
mydb

    name remarks   mob
0  vimal      ok  1111
1   abhi    good  2222
2  rahul   vgood  3333

In [29]:
mydb["mob"]

0    1111
1    2222
2    3333
Name: mob, dtype: int64

In [31]:
mydb.size

9

In [32]:
mydb.ndim

2

In [34]:
mydb.shape

(3, 3)

In [35]:
mydb[["name","mob"]]

    name   mob
0  vimal  1111
1   abhi  2222
2  rahul  3333

In [39]:
mydb.loc[ [1,2] ]

    name remarks   mob
1   abhi    good  2222
2  rahul   vgood  3333

In [40]:
mydb.loc[ [0,1] ]

    name remarks   mob
0  vimal      ok  1111
1   abhi    good  2222

In [42]:
pandas.read_csv("Book1.csv")

    name  age   mob remarks
0   jack   23  1111      ok
1  harry   22  2222    good
2  umesh   21  3333   vgood

In [45]:
mynewdb = pandas.read_csv("Book1.csv")

In [46]:
type(mynewdb)

pandas.core.frame.DataFrame

In [47]:
mynewdb.describe()

        age     mob
count   3.0     3.0
mean   22.0  2222.0
std     1.0  1111.0
min    21.0  1111.0
25%    21.5  1666.5
50%    22.0  2222.0
75%    22.5  2777.5
max    23.0  3333.0